#+TITLE: Python project setup
#+OPTIONS: toc:nil

* Pre-requirements
:PROPERTIES:
:header-args: :noweb-ref pre-requirements
:END:

*This section walks us through the installation of python and virtualenv*

1. Install python as follows (the binaries can be found [[https://www.python.org/downloads/release/python-361/][here]]):
    + To install on Linux/OSX
      #+BEGIN_SRC shell :results silent
      if [ "$(uname)" == "Darwin" ]; then
        brew install python3
      elif [ "$(expr substr $(uname -s) 1 5)" == "Linux" ]; then
        PYTHON_SRC="Python-3.6.1"
        curl -O https://www.python.org/ftp/python/3.6.1/$PYTHON_SRC.tgz
        tar -xf $PYTHON_SRC.tgz && cd $PYTHON_SRC
        which python3 || ./install.sh
      fi
      #+END_SRC

    + Verify that the installation was successful:
      #+BEGIN_SRC shell
      python3 --version
      #+END_SRC
      #+RESULTS:
      : Python 3.6.1

    + (Optional) Alias /python3/ to /python/ by running the script below:
      #+BEGIN_SRC shell
      PYTHON_ALIAS="alias python=python3"
      if [ -f ~/.bashrc ]; then
        echo $PYTHON_ALIAS >> ~/.bashrc
      elif [ -f ~/.zshrc ]; then
        echo $PYTHON_ALIAS >> ~/.zshrc
      fi
      reset
      #+END_SRC
      #+RESULTS:

2. Set up virtual environment for python3
    + Install virtual environment wrapper
      #+BEGIN_SRC shell :results silent
      pip3 install virtualenv
      pip3 install virtualenvwrapper
      #+END_SRC

    + Create a folder that will contain all your virtual environments:
      #+BEGIN_SRC shell
      mkdir ~/.virtualenvs
      #+END_SRC
      If you are looking for python binaries and other installed dependencies,
      they will be found in this folder.

      #+RESULTS:
   
    + Add relevant environment variables to your shell profile:
      #+BEGIN_SRC shell
      add_env_vars="export WORKON_HOME=~/.virtualenvs \n
      export VIRTUALENVWRAPPER_PYTHON=$(which python3) \n
      export VIRTUALENVWRAPPER_VIRTUALENV=$(which virtualenv) \n
      source $(which virtualenvwrapper.sh)"
      
      if [ -f $HOME/.bashrc ]; then
        echo $add_env_vars >> $HOME/.bashrc
      elif [ -f $HOME/.zshrc ]; then
        echo $add_env_vars >> $HOME/.zshrc
      fi
      reset
      #+END_SRC
      #+RESULTS:

